In [1]:
import pandas as pd

In [2]:
df = pd.read_csv ('CTA_-_Ridership_-__L__Station_Entries_-_Daily_Totals.csv')
df.head()

   station_id       stationname        date daytype  rides
0       41280    Jefferson Park  12/22/2017       W  6,104
1       41000  Cermak-Chinatown  12/18/2017       W  3,636
2       40280      Central-Lake  12/02/2017       A  1,270
3       40140   Dempster-Skokie  12/19/2017       W  1,759
4       40690          Dempster  12/03/2017       U    499

In [3]:
df.shape

(1088958, 5)

In [6]:
df.dtypes

station_id      int64
stationname    object
date           object
daytype        object
rides          object
dtype: object

In [7]:
df_UICHalsted = df.loc[(df['station_id'] == 40350)]
df_UICHalsted.head()

     station_id  stationname        date daytype  rides
74        40350  UIC-Halsted  12/08/2017       W  7,462
113       40350  UIC-Halsted  12/30/2017       A    837
397       40350  UIC-Halsted  12/13/2017       W  5,828
568       40350  UIC-Halsted  12/11/2017       W  5,614
578       40350  UIC-Halsted  12/20/2017       W  3,072

In [10]:
df_UICHalsted.shape

(7643, 5)

In [18]:
df_UICHalsted.to_csv('UIC_Halsted.csv', sep=",")
# df_UICHalsted.to_csv('UIC_Halsted.tsv', sep="\t")

In [24]:
df_oHare = df.loc[(df['station_id'] == 40890)]
df_oHare.head()

      station_id     stationname        date daytype   rides
60         40890  O'Hare Airport  12/26/2017       W  11,094
538        40890  O'Hare Airport  12/01/2017       W  12,447
671        40890  O'Hare Airport  12/11/2017       W  10,136
857        40890  O'Hare Airport  12/12/2017       W   9,406
1062       40890  O'Hare Airport  12/25/2017       U   7,244

In [25]:
df_oHare.shape

(7639, 5)

In [20]:
# df_oHare.to_csv('Ohare.csv', sep=",")
df_oHare.to_csv('Ohare.tsv', sep="\t")

In [21]:
df_Washington = df.loc[(df['station_id'] == 40370)]
df_Washington.head()

     station_id          stationname        date daytype   rides
32        40370  Washington/Dearborn  12/23/2017       A   6,744
250       40370  Washington/Dearborn  12/25/2017       U   1,696
686       40370  Washington/Dearborn  12/20/2017       W  13,896
728       40370  Washington/Dearborn  12/30/2017       A   4,182
743       40370  Washington/Dearborn  12/16/2017       A   7,984

In [22]:
df_Washington.shape

(7646, 5)

In [27]:
# df_Washington.to_csv('Washington.csv', sep=",")
df_Washington.to_csv('Washington.tsv', sep="\t")